{"backend": "tensorflow", "config": [{"config": {"batch_input_shape": [null, 300, 1], "dtype": "float32", "trainable": true, "layer": {"config": {"return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "use_bias": true, "unroll": false, "name": "lstm_1", "unit_forget_bias": true, "stateful": false, "recurrent_regularizer": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "trainable": true, "dropout": 0.0, "bias_regularizer": null, "return_sequences": false, "bias_constraint": null, "kernel_regularizer": null, "implementation": 1, "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 1.0}, "class_name": "RandomNormal"}, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "units": 30, "activation": "tanh"}, "class_name": "LSTM"}, "name": "bidirectional_1", "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"config": {"mean": 0.0, "seed": null, "stddev": 1.0}, "class_name": "RandomNormal"}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "units": 3, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.1.3"}